answers_dict = {
    "Ձեռնարկության հիմնական միջոցներ, դրանց դասակարգումն ու կառուցվածքը": "Ձեռնարկության հիմնական միջոցները այն ակտիվներն են, որոնք օգտագործվում են արտադրական գործընթացում և ունեն երկարաժամկետ օգտագործման հնարավորություն։ Դրանք կարող են բաժանվել անշարժ գույքի, տեխնիկական սարքերի, մեքենաների և այլն։ Դասակարգումը կախված է նրանց էությունից, օգտագործման բնույթից և տնտեսական նշանակությունից։",

    "Ռազմավարական պլանավորման տրամաբանությունը և փուլերը": "Ռազմավարական պլանավորումը ուղղված է ձեռնարկության երկարաժամկետ զարգացման նպատակների հասնելուն։ Այն ներառում է նախնական վերլուծություն, նպատակների սահմանում, ռազմավարության ընտրություն, իրականացում և հետևողական վերահսկում։ Մեկը հիմնական փուլերից է իրավիճակի գնահատումը՝ ներքին և արտաքին գործոնների վերլուծություն, ուժեղ և թույլ կողմերի հայտնաբերում։",

    "Շրջանառու միջոցներ, դրանց օգտագործման արդյունավետությունը բնութագրող ցուցանիշները": "Շրջանառու միջոցները ներառում են այն ակտիվները, որոնք անմիջապես մասնակցում են արտադրության գործընթացին՝ փող, վարկեր, պահեստներ, արտադրության համար անհրաժեշտ նյութեր։ Դրանց օգտագործման արդյունավետությունը չափվում է դրանց արագ շրջանառությամբ, պաշարների օգտագործման համաչափությամբ և եկամտաբերությամբ։",

    "Մոտիվացիայի գործընթացային տեսություն": "Մոտիվացիայի գործընթացային տեսությունը հիմնված է այն գաղափարի վրա, որ մարդու վարքը առաջանում է ինտերակտիվ և դինամիկ մոտիվացիոն գործընթացների արդյունքում։ Այդ գործընթացը սկսվում է պահանջմունքների և նպատակների ձևավորումից, այնուհետև ակտիվացվում է վարքագծով, որի արդյունքում մարդը ձգտում է իր նպատակներին հասնել։",

    "Պլանավորման էությունը և խնդիրները": "Պլանավորումը կազմակերպության կամ ձեռնարկության համար նպատակների, միջոցների և ընթացիկ գործողությունների նախնական հաշվարկն է։ Պլանավորման էությունն այն է, որ կազմակերպության բոլոր գործընթացները պետք է ունենան ճշտված նպատակներ և քայլեր՝ դրանց իրականացման համար։ Պլանավորման խնդիրներն են՝ արդյունավետություն, ռեսուրսների ճիշտ օգտագործում և ռիսկերի մինիմալիզացում։",

    "Հիմնական միջոցներ, դրանց օգտագործման արդյունավետությունը բնութագրող ցուցանիշները": "Հիմնական միջոցներն այն ակտիվներն են, որոնք անմիջապես կամ միջանկյալ օգտագործվում են ձեռնարկության արտադրական գործընթացում։ Դրանց արդյունավետությունը գնահատվում է՝ հաշվի առնելով օգտագործման տևողությունը, եկամտաբերությունը և գործառնական ծախսերի հարաբերակցությունը։",

    "Կառավարման էությունը, պատմությունը, կառավարման գործառույթները": "Կառավարումը տվյալ կազմակերպության նպատակներին հասնելու ուղղությամբ կազմակերպված աշխատանքի համակարգ է։ Դրա պատմությունը սկսվում է հնագույն ժամանակներից, երբ առաջնորդները կայացնում էին կարևոր որոշումներ՝ ռեսուրսների կառավարման համար։ Ժամանակակից կառույցներում կառավարման տեսությունները բազմազան են։ Կառավարման հիմնական գործառույթներն են պլանավորումը, կազմակերպումը, առաջնորդումը և վերահսկումը։",

    "Հիմնական միջոցների հասկացությունը և գնահատումը: Հիմնական միջոցների օգտագործման արդյունավետությունը բնութագրող ցուցանիշները": "Հիմնական միջոցները ներառում են տևականորեն օգտագործվող ակտիվները, ինչպիսիք են շենքերը, մեքենաները և սարքավորումները։ Դրանց գնահատումը կատարվում է դեկոմպոզիցիայով՝ հաշվի առնելով օգտագործման տևողությունը, շուկայական արժեքը և եկամտաբերությունը։ Շնորհիվ դրանց, կազմակերպությունը կարող է հասնել ավելի բարձր արտադրողականության։",

    "Ինքնարժեքի գնահաշվարկը": "Ինքնարժեքը կազմակերպության արտադրած կամ վաճառած ապրանքի կամ ծառայության ընդհանուր ծախսերի գումարն է։ Գնահաշվարկը կատարում է ծախսերի տարանջատման և հաշվարկման միջոցով՝ հաշվի առնելով արտադրության բոլոր փուլերը, նյութերի, աշխատանքի և այլ ռեսուրսների ծախսերը։",

    "Ինտուիտիվ և դատողությունների վրա հիմնված որոշումներ": "Ինտուիտիվ որոշումները հիմնված են անձնական փորձի, զգացողությունների և սուբյեկտիվ գնահատականի վրա, որոնք թույլ են տալիս արագ արձագանքել իրավիճակներին, երբ անհրաժեշտ է որոշում կայացնել առանց ամբողջական տվյալների։ Դատողությունների վրա հիմնված որոշումները ենթադրում են տրամաբանական վերլուծություն, հիմնված փաստերի վրա, և դրանք սովորաբար պահանջում են երկարաժամկետ գնահատում։",

    "Շահութաբերություն, շահութաբերության գործակիցներ": "Շահութաբերությունը որոշում է ձեռնարկության կամ կազմակերպության կարողությունը՝ ստանալու շահույթ՝ հաշվի առնելով ծախսերը։ Շահութաբերության գործակիցները ներառում են բիզնեսի շահույթի հարաբերությունը շրջանառության կամ ներդրված միջոցների նկատմամբ։ Այս գործակիցները տարբերակվում են շահույթի համախմբման և արդյունավետության վերլուծությամբ։",

    "Ցանցային կառուցվածք՝ առավելություններ և թերություններ": "Ցանցային կառուցվածքը ենթադրում է բազմազան կապերի համակարգ՝ հիմնված թիմերի կամ ստորաբաժանումների միջև ուղղակի փոխհարաբերությունների վրա։ Առավելություններն են՝ արագ տվյալների փոխանակում, կոորդինացիա և ճկունություն, սակայն թերությունները կարող են լինել հետագա բացասական ազդեցությունները կառավարման վրա, քանի որ բացակայում են որոշակի հստակություն և վերահսկողություն։",

    "Լիազորություն, աշխատանքի փոխանցում և պատասխանատվություն": "Լիազորությունը վերաբերում է իշխանության օգտագործման իրավունքի տրամադրմանը՝ որոշումներ կայացնելու, ուժի գործադրման և ռեսուրսների բաժանման հարցում։ Աշխատանքի փոխանցումը ենթադրում է պարտականությունների վերաբաշխում տարբեր աշխատողների կամ ստորաբաժանումների միջև։ Պատասխանատվությունը նշանակալից է՝ աշխատանքային գործողությունների արդյունքների համար պատասխանատվություն կրելու հարցում։",

    "Ձեռնարկության եկամուտները": "Եկամուտները ձեռնարկության կողմից ստացված գումարներն են, որոնք գալիս են վաճառքից կամ ծառայություններից։ Հիմնական եկամուտները կարող են լինել ապրանքի վաճառքից կամ մասնաբաժիններից, իսկ բոնուսային եկամուտները՝ ենթակառուցվածքային և աջակցող ծառայություններից։ Եկամուտները հանդիսանում են ձեռնարկության ֆինանսական կայունության կարևոր գործոն։",

    "Ներդրումների տնտեսական էությունն ու դասակարգումը": "Ներդրումները դա այն միջոցներն են, որոնք ներդրվում են արտադրողականություն և եկամուտ ստեղծելու նպատակով։ Դրանք կարող են լինել ֆինանսական, նյութական կամ մարդկային ներդրումներ։ Դասակարգումը կատարվում է ըստ ներդրման տեսակի՝ արտաքին կամ ներքին ներդրումներ, անձնական կամ կորպորատիվ ներդրումներ։",

    "Մոտիվացիայի էությունը և նրա ձևերը": "Մոտիվացիան մարդու ներշնչվածություն է՝ կատարելու որոշակի գործողություն՝ նպատակին հասնելու համար։ Այն կարող է լինել ներքին՝ անձնական հետաքրքրություն կամ արտաքին՝ նյութական խթաններ։ Կան նաև տարբեր տեսություններ՝ մաքուր նյութական խթաններից մինչև մենթալ մոտիվատորներ, որոնք առաջանում են ինքնավստահության և ինքնարժանացման ձգտումներից։",

    "Հիմնական միջոցների ամորտիզացիա, հաշվարկման մեթոդներ": "Հիմնական միջոցների ամորտիզացիան այն գործընթացն է, որը վերաբերում է այս միջոցների արժեքի մարումն իրենից առաջ գնարկված ծախսերի միջոցով։ Ամորտիզացիայի հիմնական մեթոդները ներառում են ուղղակի, բաշխված կամ կուտակված մեթոդներ՝ կախված այն բանից, թե ինչպես է հաշվարկվում նյութական միջոցի արժեքը ըստ ժամանակի։",

    "Գինը, դրա գործառույթները, տեսակները և կարգավորման եղանակները": "Գինը այն գումարն է, որը վճարվում է ապրանքի կամ ծառայության դիմաց։ Գնի գործառույթները ներառում են փոխանակում, տրամադրում և պահպանում։ Գները կարող են լինել մատակարարման կամ պահանջարկի վրա հիմնված, իսկ դրանց կարգավորումը իրականացվում է պետական կամ շուկայական մեթոդներով՝ կախված շուկայի ազատության մակարդակից։",

    "Հաղորդակցման գործընթաց": "Հաղորդակցման գործընթացը տեղեկության փոխանցման և ստացման համակարգ է, որն ունի հաղորդող, հաղորդակցման ալիքներ, հաղորդակցության նպատակ՝ ապահովելու երկու կողմերի միջև տեղեկատվության ճիշտ և արդյունավետ փոխանցումը։ Այս գործընթացը կարող է լինել բանավոր կամ ոչ բանավոր՝ կախված հաղորդակցման ձևից։",

    "Ձեռնարկության հիմնական միջոցների ընդհանուր բնութագիրը, դասակարգումն ու կառուցվածքը": "Հիմնական միջոցները համարվում են ձեռնարկության հիմնական ակտիվները, որոնք օգտագործվում են արտադրական գործընթացում։ Դրանք կարող են ներառել շենքեր, սարքավորումներ, մեքենաներ։ Դասակարգումը տեղի է ունենում ըստ օգտագործման տևողության և արտադրական նշանակության՝ ապահովելով արտադրանքի կամ ծառայությունների ստեղծման հնարավորությունը։",

    "Ձեռնարկության արտաքին և ներքին միջավայրերի գործոններ": "Երկու հիմնական գործոնները՝ արտաքին և ներքին, ազդում են ձեռնարկության գործունեության վրա։ Արտաքին գործոնները ներառում են շուկայի պահանջարկը, հասարակական քաղաքականությունը, տնտեսական փոփոխությունները, իսկ ներքին գործոնները վերաբերում են կազմակերպության ներքին ռեսուրսներին, մարդկային ռեսուրսներին, կառավարման մշակույթին։",

    "Ձեռնարկության ծախսերը, դրանց կառուցվածքը և դասակարգումը": "Ձեռնարկության ծախսերն են բոլոր այն վճարումները, որոնք կատարվում են արտադրության և ծառայությունների մատուցման ընթացքում։ Դրանք կարող են լինել հիմնական և լրացուցիչ ծախսեր՝ կախված դրա օգտագործման ուղղությունից։ Դասակարգումը կատարվում է ըստ ծախսերի տեսակի՝ արտադրական, վերամշակման, մարքեթինգի և այլն։",

    "Ներդրումային նախագծերի արդյունավետության գնահատումը": "Ներդրումային նախագծերի արդյունավետության գնահատումը հնարավորություն է տալիս որոշելու, թե արդյոք նախագիծը կբերի ցանկալի արդյունքներն ու եկամուտները։ Հիմնական մեթոդներն են ներդրումների վերադարձի հաշվարկը, հնարավոր ռիսկերն ու ազդեցությունները, գումարային հաշվարկը և այլ հաշվարկներ՝ որոշելու նախագծի տնտեսական արդյունավետությունը։",

    "Վերահսկման գործընթացի հիմնական տարրերը և փուլերը": "Վերահսկումը ներառում է կազմակերպության գործունեության նկատմամբ հետևողական վերահսկում։ Այն բաղկացած է ծրագրերի գնահատումից, ընթացքի վերահսկումից, արդյունքների համեմատությունից և անհրաժեշտության դեպքում փոփոխությունների իրականացումից՝ նպատակին հասնելու համար։",

    "Ինքնարժեքը, ինքնարժեքի իջեցման ուղղությունները": "Ինքնարժեքը ներկայացնում է ապրանքի կամ ծառայության արտադրության համար նախատեսված ամբողջ ծախսերը։ Իջեցման ուղիները ներառում են՝ արդյունավետության բարձրացում, նյութերի օգտագործման օպտիմալացում, արտադրական գործընթացների բարելավում, էներգիայի խնայողություն և այլ եղանակներ։",

    "Ձեռնարկության կառավարման կազմակերպչական կառուցվածքը": "Կառավարման կազմակերպչական կառուցվածքը կարևոր մաս է կազմում ձեռնարկության ղեկավարումն ու աշխատանքը։ Այն որոշում է, թե ինչպես են համակարգված ստորաբաժանումները, թե ով և ինչ որոշումներ է կայացնում։ Կառուցվածքը կարող է լինել հիերարխիկ, մետոդիկ կամ ցանցային՝ կախված ձեռնարկության գործառույթների բարդությունից։",

    "Միջանձնային հաղորդակցում": "Միջանձնային հաղորդակցումը վերաբերում է այն փոխազդեցությանը, որը տեղի է ունենում մարդկանց միջև։ Այն ներառում է լեզվաբառարանական, ոչ լեզվաբառարանական և զգայական հաղորդագրություններ, որոնք ուղարկվում են ուղղակիորեն, կամ միջնորդավորված կերպով՝ նպատակ ունենալով տեղեկատվության փոխանցում կամ փոխըմբռնում։",

    "Ռազմավարության էությունը, ռազմավարական պլանավորման գործընթացը": "Ռազմավարության էությունը վերաբերում է այն երկարաժամկետ ուղեգծերին, որոնք ձեռնարկությունը պետք է կատարի՝ հասնելու իր նպատակներին։ Ռազմավարական պլանավորման գործընթացը ներառում է իրավիճակի վերլուծություն, նպատակների սահմանում, ռազմավարությունների ընտրություն, իրականացման պլան և վերահսկում։",

    "Կազմակերպաիրավական կառուցվածքի ձևերը": "Կազմակերպաիրավական կառուցվածքը ներկայացնում է կազմակերպության վարչական և իրավական կարգավորման համակարգը, որը ձևավորում է այն միջավայրը, որտեղ իրականացվում են գործառնությունները։ Այն կարող է լինել մի քանի ձևերի՝ մեկ անձի կառավարման, կոլեկտիվ կառավարման, ֆունկցիոնալ և մենեջմենտի այլ տեսակներ։",

    "Դիվիզիոնային կառուցվածք: Միջազգային կառուցվածքներ: Նախագծային կառուցվածք": "Դիվիզիոնային կառուցվածքն օգտագործվում է մեծ կազմակերպություններում, որտեղ առկա է մի քանի ստորաբաժանումներ, որոնք պատասխանատու են տարբեր արտադրանքների կամ շուկաների համար։ Միջազգային կառուցվածքները վերաբերում են այնպիսի կազմակերպությունների կառավարմանը, որոնք գործում են տարբեր երկրներում։ Նախագծային կառուցվածքը ներառում է մենեջմենտի ձև, որը հիմնված է տարբեր նախագծերի վրա, որտեղ յուրաքանչյուր նախագիծ ունի իր թիմը։",

    "Ծախսերի սահմանումը, ձեռնարկության ծախսերն ըստ տնտեսական տարրերի, հաստատուն և փոփոխական ծախսերը": "Ծախսերը այն ֆինանսական միջոցներն են, որոնք ձեռնարկությունն օգտագործում է իր արտադրական գործընթացի մեջ։ Դրանք կարող են լինել հաստատուն՝ անկախ արտադրանքի քանակից (օրինակ՝ վարձակալության վճարներ), և փոփոխական՝ կախված արտադրանքի քանակից (օրինակ՝ նյութերի գնման ծախսեր)։",

    "Կանխատեսում և որոշումների կայացում": "Կանխատեսումը վերաբերում է ապագայի վերաբերյալ կանխորոշումների կատարելուն, հիմնված անցյալի տվյալների վրա։ Դրա միջոցով ստացվում է կարևոր տեղեկատվություն տարբեր գործողությունների համար։ Դրանից բխում է որոշումների կայացումը՝ հիմնված այն կանխատեսումների վրա, որոնք օգնում են կազմակերպությանը վարվել ի տարբերություն անորոշության։",

    "Պլանավորման էությունը և խնդիրները: Ռազմավարության էությունը": "Պլանավորումը այն գործընթացն է, որը նպատակ ունի կազմակերպության գործունեությունը համակարգելու և ուղեցույցներ տրամադրելու համար։ Այն ընդգրկում է նպատակների սահմանում, միջոցների բաշխում և գործողությունների նախապատրաստում։ Ռազմավարությունը վերաբերում է այն երկարաժամկետ ուղեգծերին, որոնք թույլ են տալիս կազմակերպությանը հաջողությամբ հասնել իր նպատակներին։",

    "Առաքելություն: Նպատակներ: Արտաքին միջավայրի վերլուծություն: Ներքին միջավայրի կառավարման թույլ և ուժեղ կողմերի վերլուծություն": "Առաքելությունը կազմակերպության գոյության պատճառն է, իսկ նպատակները սահմանում են այն հասանելի նպատակները, որոնք պետք է իրականացվեն։ Արտաքին միջավայրի վերլուծությունը ընդգրկում է շուկան, մրցակցությունը և տնտեսական փոփոխությունները։ Ներքին միջավայրի վերլուծությունը գնահատում է կազմակերպության ներքին ռեսուրսներն ու կարողությունները՝ ուժեղ և թույլ կողմերի տեսանկյունից։",

    "Գների ձևավորումը և գնագոյացման քաղաքականությունը": "Գների ձևավորումը այն գործընթացն է, որի ընթացքում որոշվում է ապրանքի կամ ծառայության գինը՝ հիմնված մրցակցային շուկայով, նյութական ծախսերով և սպառողական պահանջարկով։ Գնագոյացման քաղաքականությունը կարող է տարբեր լինել՝ կախված այնպիսի գործոններից, ինչպիսիք են վաճառքի ռազմավարությունը, շուկայական դիրքը և միջավայրը։",

    "Ձեռնարկության եկամուտը և հասույթը, դրանց տարբերությունները": "Եկամուտը վերաբերում է այն բոլոր միջոցներին, որոնք ձեռնարկությունը ստանում է իր գործունեությունից, ներառյալ վաճառքները, ծառայությունների մատուցումն ու այլ տեսակի վարձույթներ։ Հասույթը, ընդհակառակը, այն գումարն է, որն առաջանում է միայն հիմնական գործունեությունից՝ ապրանքների կամ ծառայությունների վաճառքից։ Հասույթը կրճատվում է ծախսերով՝ եկամուտը ներկայացնելու համար։",

    "Ներդրումները և դրանց տեսակները": "Ներդրումները վերաբերում են այն ֆինանսական միջոցներին, որոնք ծախսվում են տարբեր տնտեսական նախագծերի և զարգացման համար։ Դրանք կարող են լինել ուղիղ ներդրումներ՝ կապիտալի տեղաբաշխումը ձեռնարկության մեջ, և անուղղակի ներդրումներ՝ ֆինանսական պաշարների կամ կապիտալի ներդրում տարբեր ֆոնդերում, արժեթղթերում։",

    "Աշխատանքի վարձատրություն": "Աշխատանքի վարձատրությունը աշխատողներին վճարվող գումարն է, որն առաջարկվում է նրանց կատարած աշխատանքի դիմաց։ Վարձատրությունը կարող է լինել հիմնական՝ աշխատավարձ, և բոնուսներ կամ այլ խթաններ, որոնք կախված են աշխատանքի արդյունքներից։",

    "Ձեռնարկության ներքին և արտաքին միջավայրերը": "Ներքին միջավայրը վերաբերում է կազմակերպության ներքին գործոններին՝ աշխատակիցներ, կառավարման կառուցվածք, մշակույթ և արտադրական ռեսուրսներ։ Արտաքին միջավայրը վերաբերում է այն գործոններին, որոնք դուրս են կազմակերպությունից՝ շուկա, մրցակցություն, տնտեսական վիճակ, տեխնոլոգիական զարգացումներ, քաղաքական փոփոխություններ։",

    "Գների տեսակները և դրանց առանձնահատկությունները": "Գների տեսակները ներառում են արտադրողական, վաճառքի, ծառայությունների, շուկայի ու սպառողական գներ։ Յուրաքանչյուր տեսակի գին ունի իր առանձնահատկությունները՝ որոշված տվյալ շուկայի պահանջարկով, մրցակցությամբ և արտադրական ծախսերով։",

    "Ռացիոնալ կառավարչական որոշումներ": "Ռացիոնալ կառավարչական որոշումները վերաբերում են այն որոշումներին, որոնք հիմնված են փաստական տվյալների վրա, հաշվարկներով և օպտիմալ տարբերակների ընտրությամբ։ Նրանք պետք է ապահովեն առավելագույն արդյունավետություն և նվազեցնեն ռիսկերն ու կորուստները։",

    "Լիազորություն, աշխատանքի փոխանցում և պատասխանատվություն: Գծային և ապարատային լիազորություն": "Լիազորությունն իրավունք է, որը տրամադրվում է որոշումներ ընդունելու և պատասխանատվություն կրելու համար։ Աշխատանքի փոխանցումը նշանակում է աշխատանքային պարտականությունների հանձնարարում։ Գծային լիազորությունը վերաբերում է անմիջական հրամանների կատարմանը, իսկ ապարատային լիազորությունը ներառում է խորհրդատվություն և աջակցություն։",

    "Ձեռնարկության սահմանումը և կազմակերպա-իրավական ձևերը": "Ձեռնարկությունը տնտեսապես ակտիվ կազմակերպություն է, որը շահույթ ստանալու նպատակով իրականացնում է ձեռնարկատիրական գործունեություն։ Կազմակերպա-իրավական ձևերն ընդգրկում են տարբեր իրավաբանական կարգավիճակներ՝ մասնավոր սեփականություն, սահմանափակ պատասխանատվություն կամ բաժնետիրական ընկերություններ։",

    "Ինքնարժեքի նշանակությունը։ Ինքնարժեքի կալկուլյացիա": "Ինքնարժեքը ցույց է տալիս արտադրանքի պատրաստման համար ծախսված ֆինանսական միջոցները։ Այն հաշվարկվում է բոլոր գործառնական ծախսերի՝ նյութերի, աշխատանքի և այլ ծախսերի գումարով։ Ինքնարժեքի նվազեցումը ուղղված է արտադրության արդյունավետության բարելավմանը։",

    "Այլընտրանքների գնահատում և ընտրում: Ռազմավարության իրականացում: Մարտավարություն: Ռազմավարության գնահատում": "Այլընտրանքների գնահատումն ու ընտրումը ներառում է տարբեր գործառնական և ֆինանսական որոշումների մշակումը, որոնց միջոցով ընկերությունը կարող է ընտրել լավագույն հնարավորությունը։ Ռազմավարության իրականացումը կենտրոնանում է երկարաժամկետ նպատակների հասնելու վրա։ Մարտավարությունը կենտրոնանում է որոշակի խնդիրների լուծման վրա՝ համապատասխան ժամանակահատվածում։ Ռազմավարության գնահատումը պետք է իրականացվի արդյունքների հիման վրա՝ որպեսզի պարզվի, թե ինչպես է ռազմավարությունը գործել։",

    "Կազմակերպման գործառույթը և դրա առանձնահատկությունները ձեռնարկություններում": "Կազմակերպման գործառույթը ընկերության կամ կազմակերպության կառուցվածքի ձևավորումն է՝ ներառելով աշխատանքային պարտականությունների, պատասխանատվության և արդար վարձատրության բաժանումը։ Գործառույթը պետք է ապահովի կազմակերպության արդյունավետություն և ռեսուրսների օպտիմալ օգտագործում։",

    "Միջանձնային հաղորդակցում: Կազմակերպչական հաղորդակցում": "Միջանձնային հաղորդակցումը վերաբերում է անձերի միջև հաղորդակցությանը՝ ընդհանուր նպատակների հասնելու համար։ Կազմակերպչական հաղորդակցումը վերաբերում է տեղեկատվության փոխանցմանը այն անձանց միջև, որոնք գործում են նույն կազմակերպության ներսում, որպեսզի հասնեն ընդհանուր նպատակներին։",

    "Բիզնես ծրագիր, ծրագրի հիմնական բաժինները": "Բիզնես ծրագիրը այն փաստաթուղթն է, որը ներկայացնում է ձեռնարկության զարգացման ռազմավարությունը, ֆինանսական պլանը, շուկայի վերլուծությունը, մրցակցային ռազմավարությունները և եկամուտների կանխատեսումները։ Այն պետք է ներառի ֆինանսական հատվածներ, շուկայի վերլուծություն, կազմակերպչական կառուցվածք և զարգացման ռազմավարություն։",

    "Մոտիվացիայի էությունը և նրա ձևերը: Պահանջմունքներ: Պարգևատրություն": "Մոտիվացիան այն ներքին կամ արտաքին խթաններն են, որոնք մարդուն ուղղորդում են դեպի նպատակին հասնելու համար։ Մոտիվացիայի ձևերը ներառում են նյութական խթաններ՝ աշխատավարձ, բոնուսներ, ինչպես նաև ոչ նյութական՝ ճանաչում, զարգացման հնարավորություններ։ Պարգևատրումը վերաբերում է պարգևներին՝ աշխատավարձից ավելին, որոնք տրվում են կատարած աշխատանքի համար։",

    "Շրջանառու միջոցների կառուցվածքը և շրջապտույտը": "Շրջանառու միջոցները այն ֆինանսական միջոցներն են, որոնք կիրառվում են կազմակերպության ընթացիկ գործունեության համար՝ արտադրությունը, ապրանքների մատակարարում, և այդ գործընթացները ենթադրում են ակտիվների փոխակերպում դրամական միջոցների։ Շրջանառության շրջապտույտը վերաբերում է այն ժամանակահատվածին, որը պահանջվում է, որպեսզի միջոցները վերադառնան որպես ֆինանսական միջոցներ։",

    "Ռազմավարական պլանավորման տրամաբանությունը և փուլերը: Առաքելություն: Նպատակներ: Արտաքին միջավայրի վերլուծություն: Ներքին միջավայրի կառավարման թույլ և ուժեղ կողմերի վերլուծություն": "Ռազմավարական պլանավորումը կենտրոնանում է երկարաժամկետ նպատակների ապահովման վրա՝ վերլուծելով ինչպես արտաքին, այնպես էլ ներքին գործոնները։ Առաքելությունը սահմանում է կազմակերպության գոյության պատճառը, իսկ նպատակները պետք է ուղղված լինեն այդ նպատակին հասնելու։ Արտաքին միջավայրի վերլուծությունն ընդգրկում է շուկան ու մրցակցությունը, իսկ ներքին վերլուծությունը գնահատում է կազմակերպության ուժեղ և թույլ կողմերը։",

    "Շահույթի էությունը: Շահույթի ձևավորումը, օգտագործումն ու բաշխումը": "Շահույթը ընկերության եկամուտն է, որը մնում է ծախսերից հետո։ Այն կարող է օգտագործվել ներդրումների համար, շահառուներին վճարումներ կատարելու, կամ ներդրվելու նոր նախագծերում։ Շահույթի բաշխումն այն գործընթացն է, որտեղ որոշվում է, թե ինչպես բաժանվի շահույթը՝ միաժամանակ վերլուծելով ընկերության ֆինանսական կարիքները և ապագա հնարավորությունները։"
}

buttons = [
    "Ձեռնարկության հիմնական միջոցներ, դրանց դասակարգումն ու կառուցվածքը",
    "Ռազմավարական պլանավորման տրամաբանությունը և փուլերը",
    "Շրջանառու միջոցներ, դրանց օգտագործման արդյունավետությունը բնութագրող ցուցանիշները",
    "Մոտիվացիայի գործընթացային տեսություն",
    "Պլանավորման էությունը և խնդիրները",
    "Ձեռնարկության ծախսերը, դրանց կառուցվածքը և դասակարգումը",
    "Հիմնական միջոցներ, դրանց օգտագործման արդյունավետությունը բնութագրող ցուցանիշները",
    "Կառավարման էությունը, զարգացման պատմությունը, կառավարման գործառույթները",
    "Հիմնական միջոցների հասկացությունը և գնահատումը: Հիմնական միջոցների օգտագործման արդյունավետությունը բնութագրող ցուցանիշները",
    "Ինքնարժեքի գնահաշվարկը",
    "Ինտուիտիվ և դատողությունների վրա հիմնված որոշումներ",
    "Շահութաբերություն, շահութաբերության գործակիցներ",
    "Ցանցային կառուցվածք՝ առավելություններ և թերություններ",
    "Լիազորություն, աշխատանքի փոխանցում և պատասխանատվություն",
    "Ձեռնարկության եկամուտները",
    "Ներդրումների տնտեսական էությունն ու դասակարգումը",
    "Մոտիվացիայի էությունը և նրա ձևերը",
    "Հիմնական միջոցների ամորտիզացիա, հաշվարկման մեթոդներ",
    "Գինը, դրա գործառույթները, տեսակները և կարգավորման եղանակները",
    "Հաղորդակցման գործընթաց",
    "Ձեռնարկության հիմնական միջոցների ընդհանուր բնութագիրը, դասակարգումն ու կառուցվածքը",
    "Ձեռնարկության արտաքին և ներքին միջավայրերի գործոններ",
    "Ձեռնարկության ծախսերը, դրանց կառուցվածքը և դասակարգումը",
    "Ներդրումային նախագծերի արդյունավետության գնահատումը",
    "Վերահսկման գործընթացի հիմնական տարրերը և փուլերը",
    "Ինքնարժեքը, ինքնարժեքի իջեցման ուղղությունները",
    "Ձեռնարկության կառավարման կազմակերպչական կառուցվածքը",
    "Միջանձնային հաղորդակցում",
    "Գների ձևավորումը և գնագոյացման քաղաքականությունը",
    "Ռազմավարության էությունը, ռազմավարական պլանավորման գործընթացը",
    "Կազմակերպաիրավական կառուցվածքի ձևերը",
    "Դիվիզիոնային կառուցվածք: Միջազգային կառուցվածքներ: Նախագծային կառուցվածք",
    "Ծախսերի սահմանումը, ձեռնարկության ծախսերն ըստ տնտեսական տարրերի, հաստատուն և փոփոխական ծախսերը",
    "Լիազորություն, աշխատանքի փոխանցում և պատասխանատվություն: Գծային և ապարատային լիազորություն",
    "Կանխատեսում և որոշումների կայացում",
    "Պլանավորման էությունը և խնդիրները: Ռազմավարության էությունը",
    "Ձեռնարկության սահմանումը և կազմակերպա-իրավական ձևերը",
    "Հիմնական միջոցների ամորտիզացիա, հաշվարկման մեթոդներ",
    "Առաքելություն: Նպատակներ: Արտաքին միջավայրի վերլուծություն: Ներքին միջավայրի կառավարման թույլ և ուժեղ կողմերի վերլուծություն",
    "Մոտիվացիայի էությունը և նրա ձևերը: Պահանջմունքներ: Պարգևատրություն",
    "Գների ձևավորումը և գնագոյացման քաղաքականությունը",
    "Ձեռնարկության եկամուտը և հասույթը, դրանց տարբերությունները",
    "Ներդրումները և դրանց տեսակները",
    "Աշխատանքի վարձատրություն",
    "Կազմակերպման գործառույթը և դրա առանձնահատկությունները ձեռնարկություններում",
    "Ձեռնարկության ներքին և արտաքին միջավայրերը",
    "Գների տեսակները և դրանց առանձնահատկությունները",
    "Ռացիոնալ կառավարչական որոշումներ",
    "Լիազորություն, աշխատանքի փոխանցում և պատասխանատվություն: Գծային և ապարատային լիազորություն",
    "Ձեռնարկության սահմանումը և կազմակերպա-իրավական ձևերը",
    "Ինքնարժեքի նշանակությունը։ Ինքնարժեքի կալկուլյացիա",
    "Այլընտրանքների գնահատում և ընտրում: Ռազմավարության իրականացում: Մարտավարություն: Ռազմավարության գնահատում",
    "Շահութաբերություն, շահութաբերության գործակիցներ",
    "Կազմակերպման գործառույթը և դրա առանձնահատկությունները ձեռնարկություններում",
    "Միջանձնային հաղորդակցում: Կազմակերպչական հաղորդակցում",
    "Բիզնես ծրագիր, ծրագրի հիմնական բաժինները",
    "Մոտիվացիայի էությունը և նրա ձևերը: Պահանջմունքներ: Պարգևատրություն",
    "Շրջանառու միջոցների կառուցվածքը և շրջապտույտը",
    "Ռազմավարական պլանավորման տրամաբանությունը և փուլերը: Առաքելություն: Նպատակներ: Արտաքին միջավայրի վերլուծություն: Ներքին միջավայրի կառավարման թույլ և ուժեղ կողմերի վերլուծություն",
    "Շահույթի էությունը: Շահույթի ձևավորումը, օգտագործումն ու բաշխումը"
]


import telebot
from telebot.types import ReplyKeyboardMarkup
# Ձեր բոտի տոկենը
API_TOKEN = '7812550423:AAF7COLqIoq2PDi-D6lidpopebhsnHSM70s'
bot = telebot.TeleBot(API_TOKEN)

markup = ReplyKeyboardMarkup()
for i in buttons:
    markup.add(i)

@bot.message_handler(commands=["start"])
def start(message: telebot.types.Message):
    bot.send_message(chat_id=message.chat.id, text="Ուղարկեք ձեր հարցը", reply_markup=markup)

@bot.message_handler(func=lambda message: True)
def answer(message: telebot.types.Message):
    for key in answers_dict:
        if key.lower().startswith(message.text.lower()):
            bot.send_message(chat_id=message.chat.id, text=f"Հարց՝ {key}")
            bot.send_message(chat_id=message.chat.id, text=f"Պատասխան՝ {answers_dict[key]}")


bot.infinity_polling()